<template>
    <div>
        <section class="about-banner relative">
            <div class="overlay overlay-bg"></div>
            <div class="container">
                <div class="row d-flex align-items-center justify-content-center">
                    <div class="about-content col-lg-12">
                        <h1 class="text-white">
                            Где я?
                        </h1>
                    </div>
                </div>
            </div>
        </section>
        <section class="sample-text-area">
            <div class="container">

                <p>
                    Вы попали на сайт для <router-link :to="{ name: 'travels' }"><strong>поиска</strong></router-link>  компании в поход или путешествие. Вы можете создать событие или же присоединиться к уже существующей группе.
                </p>
                <h5><strong>Как это работает:</strong></h5>
                <ol>
                    <li>1 вариант:</li>
                    <ol>
                        <li>Вы сами <router-link :to="{ name: 'travel_new' }"><strong>создаете событие</strong></router-link> указав даты проведения, ближайший населенный пункт, текстовое описание и по желанию добавив изображения.</li>
                        <li>Посетители на сайте откликаются на ваше предложение</li>
                        <li>При необходимости уточняете информацию в переписке</li>
                        <li>У вас готовая группа</li>
                    </ol>
                    <li>2 вариант:</li>
                    <ol>
                        <li>С помощью <router-link :to="{ name: 'travels' }"><strong>фильтра</strong></router-link>  находите интересующее вас событие</li>
                        <li>При необходимости уточняете информацию в переписке с автором</li>
                        <li>Нажимаете кнопку «подать заявку» на странице события</li>
                        <li>Автор подтверждает ваше участие</li>
                    </ol>
                </ol>

                <h5><strong>Подать заявку</strong></h5>
                <p>На странице интересующего вас события необходимо нажать кнопку «Действия» и выбрать «Подать заявку» (доступно только зарегистрированным пользователям). Как только автор события ответит на вашу заявку у вас появится уведомление.
                </p>
                <h5><strong>Создание события</strong></h5>
                <p>Создать событие можно нажав зеленый крестик в правом нижнем углу страницы <router-link :to="{ name: 'travels' }"><strong>события</strong></router-link>  и заполнив все поля формы</p>
                <h5><strong>После того как вы создали событие:</strong></h5>
                <ol>
                    <li>У вас появится одноименный чат. Он доступен только участникам. Пользователь видит только сообщения написанные после присоединения к событию.</li>
                    <li>Вы можете добавить изображения выбрав «изображения» в меню «Действия» на странице события. Для каждого изображения можно выбрать режим доступа, по умолчанию изображение видно только участникам.</li>
                    <li>Вы можете пригласить пользователя перейдя на его страницу и выбрав «Пригласить» в меню «Действия».</li>
                    <li>Информация о новых заявках и ответах на приглашения будет отображаться в уведомлениях.</li>
                    <li>Управлять участниками события можно выбрав «участники» в меню «Действия». Внимание! Если вы отклоните заявку, то пользователь не сможет повторно отправить её.</li>
                    <li>Если событие состоялось или не состоялось необходимо нажать соответствующую кнопку в меню «Действия» на странице события.</li>
                </ol>
            </div>

        </section>

    </div>
</template>

<script>
    export default {
        name: "Home"
    }
</script>

<style scoped>

</style>
